Revit 2027 API
IFCImportOptions.AutocorrectOffAxisLines Property
 Enable or disable correcting lines that are slight off-axis.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AutocorrectOffAxisLines { get; set; }
Public Property AutocorrectOffAxisLines As Boolean
	Get
	Set
public:
property bool AutocorrectOffAxisLines {
	bool get ();
	void set (bool value);
}
member AutocorrectOffAxisLines : bool with get, set
Property Value
Boolean
Remarks
 Enabling correcting lines that are slightly off-axis will snap lines that are close to axes to the nearest axis. This will reduce warnings in Revit, but may cause elements that are created from sketches to slightly change shape, and extrusions to slightly change directions. Disabling this option will leave the original geometry intact but may cause warnings in Revit. Default is true for Open IFC; it is ignored (and false) for Link IFC.
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace